//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2018, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//*************************************************************************
// Revision History
// ----------------
// $Log: $
//
//*************************************************************************
//<AMI_FHDR_START>
//
// Name:    CRB.UNI
//
// Description: Chipset Reference Board setup string definitions
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"
#include "SB.uni"
#include "ACPI.uni"

#ifndef x-AMI
#langdef   x-AMI "x-AMI"    // AMI Configuration Language
#endif

#string STR_CRB_FORM                    #language eng "Demo Board"
#string STR_CRB_FORM                    #language fra "fra Demo Board"
#string STR_CRB_FORM_HELP               #language eng "Demo Board Parameters"
#string STR_CRB_FORM_HELP               #language fra "fra Demo Board Parameters"
#string STR_PORT_FORM                    #language eng "PCI-E Port"
#string STR_PORT_FORM_HELP               #language eng "PCI-E Port Parameters"

//---------------------------------------------------------------------------
//Board Device Option
//---------------------------------------------------------------------------
#string STR_HELP                         #language eng ""
#string STR_ENABLE                       #language eng "Enabled"
#string STR_DISABLE                      #language eng "Disabled"
#string STR_ONBOARD_LAN_PXE_PROMPT          #language eng "Onboard PCIE LAN PXE ROM"
#language x-AMI "CRB001"
#string STR_ONBOARD_LAN_PXE_PROMPT_HELP     #language eng "The Onboard PCIE LAN PXE ROM "

#string STR_ONBOARD_LAN_PROMPT       #language eng "Onboard PCIE LAN"
#string STR_ONBOARD_LAN_PROMPT_HELP       #language eng "Onboard PCIE LAN"
#string STR_WIRELESS_PROMPT       #language eng "WireLess Swithc Setting"
#string STR_WIRELESS_HELP       #language eng "WireLess Swithc Enable/Disable By GPI"
#string STR_BLUETOOTH_PROMPT       #language eng "Bluetooth"
#string STR_BLUETOOTH_HELP       #language eng "Bluetooth Enable/Disable By GPI"
#string STR_WEBCAMERA_PROMPT       #language eng "Web Camera"
#string STR_WEBCAMERA_HELP       #language eng "Web Camera Enable/Disable By GPI "
#string STR_FINGER_PROMPT       #language eng "FINGERPRINT"
#string STR_FINGER_HELP       #language eng "FINGERPRINT Enable/Disable By GPI"
#string STR_LIGHTSENSOR_PROMPT       #language eng "Light Sensor"
#string STR_RADIOOFF       #language eng "Radio OFF"
#string STR_POWERDOWN       #language eng "Power Down"

#string STR_CHANNEL_INTERLEAVE              #language eng   "Channel Interleaving"
#string STR_BANK_INTERLEAVE                 #language eng   "Bank Interleaving"

#string STR_SBGPPHIDEPORT_PROMPT #language eng "Hide Unused GPP Ports"
#string STR_SBGPPENABLE_PROMPT #language eng "SB GPP Function"
#string STR_SATA_MAXGEN2_CAP_STRING      #language eng        "SATA MAXGEN2 CAP OPTION"

#string STR_NB_GPP_CORE_CONFIG              #language eng   "NB GPP Core Config"
#string STR_NB_GPP_CORE_CONFIG_HELP         #language eng   "NB GPP Core Configuration"
#string STR_GPP_CORE_X4X4                   #language eng   "GPP_CORE_x4x4"
#string STR_GPP_CORE_X4X2X2                 #language eng   "GPP_CORE_x4x2x2"
#string STR_GPP_CORE_X4X2X1X1               #language eng   "GPP_CORE_x4x2x1x1"
#string STR_GPP_CORE_X4X1X1X1X1             #language eng   "GPP_CORE_x4x1x1x1x1"

#string STR_NB_PCIE_CONNECT_TYPEA           #language eng   "Display Port 0 Output Mode"
#string STR_NB_PCIE_CONNECT_TYPEB           #language eng   "Display Port 1 Output Mode"
#string STR_NB_PCIE_CONNECT_TYPEC           #language eng   "Display Port 2 Output Mode"
#string STR_NB_PCIE_CONNECT_TYPE0           #language eng   "DP0 Output Mode"
#string STR_NB_PCIE_CONNECT_TYPE1           #language eng   "DP1 Output Mode"
#string STR_NB_PCIE_CONNECT_TYPE2           #language eng   "DP2 Output Mode"
#string STR_NB_PCIE_CONNECT_TYPE3           #language eng   "DP3 Output Mode"
#string STR_NB_PCIE_CONNECT_TYPE_HELP       #language eng   "NB PCIE Connect Type(Display Device)"

#string STR_CONNECTOR_TYPE_DP               #language eng   "DP"
#string STR_CONNECTOR_TYPE_EDP              #language eng   "eDP"
#string STR_CONNECTOR_TYPE_SLINK_DVI_D      #language eng   "Single Link DVI-D"
#string STR_CONNECTOR_TYPE_DLINK_DVI_D      #language eng   "Dual Link DVI-D"
#string STR_CONNECTOR_TYPE_HDMI             #language eng   "HDMI"
#string STR_CONNECTOR_TYPE_TRAVIS_D_TO_V    #language eng   "Travis DP-To-VGA"
#string STR_CONNECTOR_TYPE_TRAVIS_D_TO_L    #language eng   "Travis DP-To-LVDS"
#string STR_CONNECTOR_TYPE_NUTMEG_D_TO_L    #language eng   "Nutmeg DP-To-LVDS"
#string STR_CONNECTOR_TYPE_NUTMEG_D_TO_V    #language eng   "Nutmeg DP-To-VGA"
#string STR_CONNECTOR_TYPE_SLINK_DVI_I      #language eng   "Single Link DVI-I"
#string STR_CONNECTOR_TYPE_CRT              #language eng   "CRT(VGA)"
#string STR_CONNECTOR_TYPE_LVDS             #language eng   "LVDS"
#string STR_CONNECTOR_TYPE_AUTO_DETECT      #language eng   "Auto Detect"
#string STR_CONNECTOR_TYPE_DEFAULT          #language eng   "Default Settings"

#string STR_NB_ROOT_PORT_ASPM_MODE          #language eng   "  ASPM Mode Control"
#language x-AMI "CRB007"
#string STR_NB_ROOT_PORT_ASPM_MODE_HELP     #language eng   "NB Root Port ASPM Mode Control"
#string STR_ASPM_L0S                        #language eng   "L0s Entry"
#string STR_ASPM_L1                         #language eng   "L1 Entry"
#string STR_ASPM_L0S_L1                     #language eng   "L0s And L1 Entry"

#string STR_NB_ROOT_PORT_HOTPLUG_MODE       #language eng   "  Hotplug Mode Control"
#language x-AMI "CRB008"
#string STR_NB_ROOT_PORT_HOTPLUG_MODE_HELP  #language eng   "NB Root Port Hotplug Mode Control"
#string STR_HOTPLUG_BASIC                   #language eng   "Hotplug Basic"
#string STR_HOTPLUG_SERVER                  #language eng   "Hotplug Server"
#string STR_HOTPLUG_ENHANCED                #language eng   "Hotplug Enhanced"
#string STR_HOTPLUG_INBOARD                 #language eng   "Hotplug Inboard"

#string STR_NB_ROOT_PORT_LINK_SPEED         #language eng   "  Link Speed"
#language x-AMI "CRB009"

#string STR_NB_ROOT_PORT_LINK_SPEED_HELP    #language eng   "NB Root Port Pcie Link Speed, The Link Speed May Overwritten By Pspp Settings"
#string STR_MAX_SPEED                       #language eng   "Max Speed"
#string STR_PCIE_GEN1                       #language eng   "Pcie Gen1"
#string STR_PCIE_GEN2                       #language eng   "Pcie Gen2"

#string STR_PSPP_POLICY_STRING              #language eng   "PSPP Policy"
#string STR_PSPP_POLICY_HELP                #language eng   "PCIe Speed Power Policy"
#string STR_PERFORMANCE_STRING              #language eng   "Performance"
#string STR_BALANCED_HIGH_STRING            #language eng   "Balanced-High"
#string STR_BALANCED_LOW_STRING             #language eng   "Balanced-Low"
#string STR_POWER_SAVING_STRING             #language eng   "Power Saving"

#string STR_AUTO_PSI                    #language eng "Auto-PSI Control"
#string STR_AUTO_PSI_HELP               #language eng "Enable/Disable Auto-PSI Feature Of Chil VR"

#string STR_CRB_AMD_PCIE_CONTROL                   #language eng   " Pcie Port Control"
#string STR_CRB_AMD_PCIE_CONTROL_HELP              #language eng   "Disabled: Skip this page setup item, and use the default CRB setting"

#string STR_CRB_ONBOARD_TPM_PROMPT     #language eng   "AMD CRB onboard TPM control"
#language x-AMI "CRB011"
#string STR_CRB_ONBOARD_TPM_PROMPT_HELP   #language eng   "To select.0:Auto(Depend on Tcg modudle). 1:Disabled fTPM. 2:OnBoard SPI TPM2.0"
#string STR_CRB_LPC_TPM             #language eng   "Route to LPC TPM"
#string STR_CRB_SPI_TPM             #language eng   "Route to SPI TPM"

#string STR_CRB_WHCK_EHCI_DEBUG_PORT_PROMPT     #language eng   "AMD CRB EHCI Debug port switch"
#language x-AMI "CRB012"
#string STR_CRB_WHCK_EHCI_DEBUG_PORT_PROMPT_HELP   #language eng   "To select. 0 - disable debug port.   1 - enable EHCI debug port for WHCK - Debug Capability Test"

#language x-AMI "CRB013"
#string STR_CRB_SD_CONNECTOR_PROMPT   #language eng   "AMD CRB SD Connector"
#string STR_CRB_SD_CONNECTOR_PROMPT_HELP   #language eng   "If selectFCH-SD, M2 connector disabled."
#string STR_CRB_FCH_SD             #language eng   "FCH-SD"
#string STR_CRB_REALTEK_SD             #language eng   "Realtek chip-SD"

#string STR_DEVICE0_ENABLED     #language eng   "Device0"
#language x-AMI "CRB014"
#string STR_DEVICE_ENABLED_HELP   #language eng   "Enable/Disable/Auto, Auto used board default setting"

#string STR_DEVICE1_ENABLED     #language eng   "Device1"
#language x-AMI "CRB015"

#string STR_DEVICE2_ENABLED     #language eng   "Device2"
#language x-AMI "CRB016"

#string STR_DEVICE3_ENABLED     #language eng   "Device3"
#language x-AMI "CRB017"

#string STR_DEVICE4_ENABLED     #language eng   "Device4"
#language x-AMI "CRB018"

#string STR_DEVICE5_ENABLED     #language eng   "Device5"
#language x-AMI "CRB019"

#string STR_DEVICE6_ENABLED     #language eng   "Device6"
#language x-AMI "CRB020"

#string STR_DEVICE7_ENABLED     #language eng   "Device7"
#language x-AMI "CRB021"

//#string <string name>                   #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2018, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************